// ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 
// รอบที่ 2 
// รอบที่ 3 
// รอบที่ 4 
// รอบที่ 5 
package W12;

public class W12_00_exLoopWhile {

    public static void main(String[] args) {

// TODO 1
        System.out.println("TODO 1-For Loop");
        for (int i = 1; i <= 5; i++) {
            //คำสั่งที่ต้องการให้ทำซ้ำ
            System.out.println("รอบที่ " + i);
        }
        System.out.println("------------------------------");

// ====================== TODO 1 End For Loop  ===========================
        System.err.println("TODO 1-While Loop");
        int n1 = 1;
        while (n1 <= 5) {
            System.out.println("รอบที่ " + n1);
            n1++;
        }
        System.err.println("------------------------------");

//คำสั่ง 1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 Hello World
// รอบที่ 2 Hello World
// รอบที่ 3 Hello World
// รอบที่ 4 Hello World
// รอบที่ 5 Hello World
// TODO  2
        System.out.println("TODO 2-For Loop");
        for (int i = 1; i <= 5; i++) {
            //คำสั่งที่ต้องการให้ทำซ้ำ
            System.out.println("รอบที่ " + i + "Hello World");
        }
        System.out.println("----------------------------");

        System.out.println("TODO 2 While Loop");
        int n2 = 1;
        while (n2 <= 5) {
            System.out.println("");
        }
// ======================================================================
//คำสั่ง 2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10
// TODO
// ======================================================================
//คำสั่ง 2.1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10 = 55
// TODO
        int sum = 0;
        for (int j = 1; j <= 10; j++) {
        System.out.print(+" ");
            sum = sum + j;   //sum += j;
        }
        System.out.println("= " + sum);
// ======================================================================
//คำสั่ง 2.2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1+2+3+4+5+6+7+8+9+10 = 55

// TODO
        int sum = 0;
        for (int j = 1; j <= 10; j++) {
            System.out.print(+" ");
            sum = sum + j;
            if (j < 10) {
                System.out.print("+");
            }
            sum = sum + j;
        }
        System.out.println(" = " + sum);
// ======================================================================
//คำสั่ง 3 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 10 9 8 7 6 5 4 3 2 1

// TODO
        int num = 10;
        for (int p = 1; p <= 10; p++) {
            System.out.print(num + " ");
            num--;
        }
// ======================================================================
//คำสั่ง 4 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 3 5 7 9 11 13 15 17 19

// TODO  
// ======================================================================
//คำสั่ง 5 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 2 4 6 8 10 12 14 16 18 20
// TODO 8
   
      // int i = 2;
      // i+2;

      System.out.println("TODO 8-While Loop");
      int n8 = 0;
      int time = 1;
      while (time <= 10){
        n8 = time * 2;
        System.out.print(n8 + " ");
        time++;
      }
      System.out.println("\n")

// ======================================================================
//คำสั่ง 6 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 4 9 16 25 36 49 64 81 100
// TODO
        System.out.println("");
// ======================================================================
//คำสั่ง 7 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 เลขคี่
// รอบที่ 2 เลขคู่
// รอบที่ 3 เลขคี่
// รอบที่ 4 เลขคู่
// รอบที่ 5 เลขคี่
// TODO
        System.out.println();
        for (int i +1; 1 <= 5;
        i++
            
        
        
        
        
        
            ){
    if (i % 2 == 0) {
                System.out.println("รอบที่ " + i + "เลขคี่ ");
            } else {
                System.out.println("รอบที่ " + i + "เลขคู่ ");
            }

        }
// ======================================================================
